#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/mpppk/mpppk-workspace/runs/run-yoqVRWW1UstUaG9F

Waiting for the plan to start...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...
google_artifact_registry_repository.docker_registry: Refreshing state... [id=projects/mpppk-workspace/locations/asia-northeast1/repositories/docker-registry]
google_project_service.project: Refreshing state... [id=mpppk-workspace/artifactregistry.googleapis.com]
google_container_cluster.gke_cluster: Refreshing state... [id=projects/mpppk-workspace/locations/asia-northeast1/clusters/common]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.gh_sa_editor_role will be created
  + resource "google_project_iam_member" "gh_sa_editor_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "mpppk-workspace"
      + role    = "roles/editor"
    }

  # google_service_account.gh_sa will be created
  + resource "google_service_account" "gh_sa" {
      + account_id   = "github"
      + disabled     = false
      + display_name = "github"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "mpppk-workspace"
      + unique_id    = (known after apply)
    }

  # module.gh_oidc.google_iam_workload_identity_pool.main will be created
  + resource "google_iam_workload_identity_pool" "main" {
      + description               = "Workload Identity Pool managed by Terraform"
      + disabled                  = false
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "mpppk-workspace"
      + state                     = (known after apply)
      + workload_identity_pool_id = "id-pool"
    }

  # module.gh_oidc.google_iam_workload_identity_pool_provider.main will be created
  + resource "google_iam_workload_identity_pool_provider" "main" {
      + attribute_mapping                  = {
          + "attribute.actor"      = "assertion.actor"
          + "attribute.aud"        = "assertion.aud"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + description                        = "Workload Identity Pool Provider managed by Terraform"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "mpppk-workspace"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "id-pool"
      + workload_identity_pool_provider_id = "gh-provider"

      + oidc {
          + allowed_audiences = []
          + issuer_uri        = "https://token.actions.githubusercontent.com"
        }
    }

  # module.gh_oidc.google_service_account_iam_member.wif-sa["mpppk-workspace"] will be created
  + resource "google_service_account_iam_member" "wif-sa" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 4 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @mpppk, Action: `pull_request`*